reddit_clone/app/models/user.rb

    def self.find_by_credentials(username, pw)
        @user = User.find_by(username: username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "testuser"], ["LIMIT", 1]]